In [2]:
import numpy as np
import pandas as pd

In [3]:
emp_01 = pd.read_csv('employee_01.csv',header=None)
emp_02 = pd.read_csv('employee_02.csv',header=None)
dp = pd.read_csv('department.csv',header=None)

In [4]:
emp_01

   0      1      2    3
0  1    Joe  70000    3
1  2  Henry  80000    4
2  3    Sam  60000  NaN
3  4    Max  90000

In [5]:
emp_01.columns = ['Id','Name','Salary','ManagerId']
emp_01

   Id   Name  Salary ManagerId
0   1    Joe   70000         3
1   2  Henry   80000         4
2   3    Sam   60000       NaN
3   4    Max   90000

In [6]:
emp_02.columns = ['Id','Name','Salary','DepartmentId']
emp_02

   Id   Name  Salary  DepartmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [26]:
dp.columns = ['DepartmentId','DepartmentName']
dp

   DepartmentId DepartmentName
0             1             IT
1             2          Sales

In [11]:
emp_01['Id'] = emp_01.Id.astype(str)
emp_01.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Id         4 non-null      object
 1   Name       4 non-null      object
 2   Salary     4 non-null      int64
 3   ManagerId  3 non-null      object
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes

In [17]:
emp_01.merge(emp_01, left_on='ManagerId', right_on='Id', how='inner', suffixes=('_employee','_manager'))\
.query("Salary_employee > Salary_manager")[['Name_employee']]

  Name_employee
0           Joe

In [52]:
result = emp_02.merge(dp, on='DepartmentId', how='inner').groupby(['DepartmentName','Name']).Salary.max().to_frame().reset_index()

In [57]:
result.nlargest(3, 'Salary', keep='all')

  DepartmentName   Name  Salary
0             IT    Jim   90000
2             IT    Max   90000
3          Sales  Henry   80000

In [66]:
ex = emp_02.merge(dp, on='DepartmentId', how='inner').groupby(['DepartmentName']).Salary.max()
li = []
for key,value in ex.iteritems():
    li.append(result.query('DepartmentName == @key and Salary == @value'))

pd.concat(li,ignore_index=True)

  DepartmentName   Name  Salary
0             IT    Jim   90000
1             IT    Max   90000
2          Sales  Henry   80000